    {
  "projects": [
    {
      "id": 0,
      "name": "LibHub",
      "screenshots": [
        "imgs/Libhub/img1.jpg",
        "imgs/Libhub/img2.jpg",
        "imgs/Libhub/img3.jpg",
        "imgs/Libhub/img4.jpg",
        "imgs/Libhub/img5.jpg"
      ],
      "repoLink": "https://github.com/Areshkew/humble-project",
      "thumbnail": "imgs/LibHub/thumbnail.jpg",
      "privacy": "Public",
      "stack": "Python (FastAPI), Javascript (Angular)",
      "description": "LibHub is an online bookstore system that streamlines user management, book cataloging, and e-commerce functionalities. Built with a Python FastAPI backend and an Angular frontend, it features secure user authentication with JWT, PostgreSQL database integration, and automated CI/CD processes via GitHub Actions. The system includes advanced search, personalized recommendations, a shopping cart, and support for book reservations, providing a comprehensive and user-friendly platform for managing and purchasing books online."
    },
    {
      "id": 1,
      "name": "Vehicle Routing Problem",
      "screenshots": [
        "imgs/VRP/VRP-10k.webp"
      ],
      "repoLink": "https://github.com/Areshkew/VRP_VND",
      "thumbnail": "imgs/VRP/thumbnail.webp",
      "privacy": "Public",
      "stack": "C++, CMake",
      "description": "This project addresses the Vehicle Route Problem using QuadTree and Variable Neighbour Descent algorithms. The system aims to optimize vehicle routing, making it an efficient solution for various transportation and logistics scenarios."
    },
    {
      "id": 2,
      "name": "RezRPG",
      "screenshots": [
        "imgs/RezRPG/78222d33-22ea-457e-b29a-b3f4402f692c.webp",
        "imgs/RezRPG/9675f91b-8857-4db3-8031-07bb6755c90b.webp",
        "imgs/RezRPG/8cbb7b6f-3139-4b57-9051-dd8bb00ce3c8.webp",
        "imgs/RezRPG/ef5a7a3a-a90f-4945-8bba-2a685fb458b9.webp"
      ],
      "repoLink": "https://github.com/Areshkew/rezRPG",
      "thumbnail": "imgs/RezRPG/78222d33-22ea-457e-b29a-b3f4402f692c.webp",
      "privacy": "Public",
      "stack": "Javascript, KaboomJS",
      "description": "RezRPG is an exciting game that delivers a complete and challenging experience with various sprites, 3 levels, a score counter, a lives system, unique mechanics, an introduction, a final boss, different backgrounds, and an interface."
    },
    {
      "id": 3,
      "name": "AsuClean",
      "screenshots": [
        "imgs/AsuClean/asuclean.webp"
      ],
      "repoLink": "#",
      "thumbnail": "imgs/AsuClean/thumbnail.webp",
      "privacy": "Private",
      "stack": "NodeJS, Express, Angular, MySQL",
      "description": "The system is a CRUD for product and availability management, developed using Angular as the frontend and Node.js as the backend. It allows managing cities, quoters, factors, lines, prices, and includes user authentication using tokens. The frontend, built with Angular, provides a user-friendly interface to interact with the backend, which is developed in Node.js using Express.js to handle routes and requests with MySQL."
    },
    {
      "id": 4,
      "name": "UTPPlayer",
      "screenshots": [
        "imgs/UTPPlayer/UtpPlayer_dashboard.webp",
        "imgs/UTPPlayer/UtpPlayer_login.webp"
      ],
      "repoLink": "#",
      "thumbnail": "imgs/UTPPlayer/thumbnail.webp",
      "privacy": "Private",
      "stack": "NodeJS, Express, Angular, MySQL",
      "description": "A music player that includes features such as playlist creation, uploading songs with their respective cover art, and the ability to manage them (e.g., delete). Users can upload their songs for personal listening, making it a standard music player with basic functionality."
    }
  ]
}
